Tekla.Structures.ModelInternal.TypeMapper.MapTypesToIntList(System.Type[])
Convert list of model object types to list of values defined
in enum ModelObject.ModelObjectEnum
types: List of types
Tekla.Structures.Model.ModelObject.ModelObjectEnum
Returns:

Tekla.Structures.ModelInternal.TypeMapper.GetCorrectType(System.Type)
Just returns a ModelObjectEnum of correct type for the given type.
type: Type of the object
Returns: a ModelObjectEnum of correct type